[
    {
        "id": "0",
        "name": "Atlu-Bola",
        "width": 5616,
        "height": 3744,
         
        "logo_url": "assets/barangay-logos/atlubola-logo.jpg",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p><span>Barangay Atlu Bola was formerly named as Barangay San Isidro, It was named after our patron Saint San Isidro Labrador. Through the effort of the past generations the former Barangay Officials, looked adept in some significant and essential history of our place and there, they discovered that our place was one of the vast of sugarcane plantation. It is also a place where many sugarcane owners delivered their products.</span></p><p><span>According to the olds citizens of Barangay Atlu Bola there were three huge balls that were made of stones and have been used for crushing sugarcane to manufacture sugar. Then, they came up to the idea to replace the name San Isidro to Atlu Bola as reminder of the three hug stones, to give highlight to our valued history with due respect to San Isidro. The old citizens of our barangay decided to adopt its festival date which we annually celebrating every May 15.</span> </p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "1",
        "name": "Bical",
        "width": 5616,
        "height": 3744,
         
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Bical was founded in the year 1843 after a species of slender climbing bamboos called &ldquo;BICAL&rdquo; (Schizostachym diffusum), grew abundantly in the area. It was then considered as an important bamboo which was used for construction for good walking canes and further utilized as cooking furl. The founders were Luis Narciso and Mateo De Leon.&nbsp;</p><p>Bical is under the titular patronage of San Roque commonly called Apung Duquit which was further shortened to Duquit, one of the three early sitios which include Dalan a Bayu (New Road) and Sumangid Dalan (other side of the road). The Mabalacat City placed the founded of Bical earlier at 1840 by Juan Anunciacion, Alipio Anunciacion, Baltazar Anunciacion, Leoncio Narciso Calalang and Luis Amarante Narciso.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "10",
        "name": "Bundagul",
        "width": 2500,
        "height": 1667,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay bundagul is approximately 4kms. Away from the town proper. It is bounded on the east part of the city proper.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "100",
        "name": "Cacutud",
        "width": 2500,
        "height": 1656,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Ayon sa mga matatanda, ang mga tao sa Barangay Cacutud ay nagkukutud o pumuputol ng mga kahoy na ginagawang uling, dahil ditto isinunod ang pangalan nito na cacutud.</p><p>Pagsasaka ang pangunahing pinagkukunan ng kabuhayan ng mga mamamayan noon dito, may ilan-ilan pang mga magsasaka ang nagtatanim ng kanilang mga pinagkukunan ng kabuhayan hanggang sa ngayon.</p><p>Tuwing Ika-31 ng Mayo, ipinagdiriwang ang kapistahan ng Barangay Cacutud alinsunod sa kakaugalian ng mga tao, at tuwing ika-16 ng Agosto ipinagdiriwang din ng mga residente ang kaarawan ng kanilang mahal na PATRON APU SAN ROQUE.</p><p>Matatagpuan ang Barangay Cacutud sa oagitan ng Barangay Atlu-Bola at Barangay Tabun, harap ng Barangay Dolores, malapit din ito sa ginwang daan na kung tawagin ay SUBIC CLARK TARLAC EXPRESSWAY (SCTEX), at ito ay binubuo ng apat na PURO at 1 Sitio na kung tawagin ay Sitio Kagen.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "1009",
        "name": "Calumpang",
        "width": 5626,
        "height": 3635,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>It was early year of 1950. During that time, there was a program of the government regarding certain requirement to a place to be considered as a community. The majority of the residents are AETA. To all obligation on the organization of a BARANGAY were convene, that started the Composition of BARANGAY CALUMPANG. It was the aspiration of the people of BARANGAY CALUMPANG that relent an opportunity to build their own society to measure the competency on their gallantry.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "1000",
        "name": "Camachiles",
        "width": 5626,
        "height": 3635,
        "logo_url": "assets/barangay-logos/camachiles-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>During the 1960&rsquo;s, Barangay Camachiles was just a territorial enclave (Sitio) that forms part of Barangay Mabiga, form the then Municipality of Mabalacat, Pampanga. Its far location from the center of the barangay itself, hampers the delivery of services from the government, thus depriving the people of their basic needs from the authorities.</p><p>Due to these deprivations and considering that its population were high enough and could be its own, a barangay; a local resident by the name of Manuel M. Dizon persistently pressed on until it was finally became independent from Barangay Mabiga.</p><p>Hon. Manuel M. Dizon became the first Tiniente Del Barrio in 1960 until 1965. He continued to hold the office until 1967, now as Punong Barangayl; retaining the same functions and powers, but changing his official title by virtue of the Democratic Rule during the Presidency of Ferdinand E. Marcos. He was succeeded by Hon. Marcelino P. Tique (1967-1972) and Hon. Dionisio P. Magsino (1973-1982).</p><p>It was during the time of Hon. Pacifico F. Gonzales (1983-1985) sometime in 1983, that Barangay Camachiles was officially recognized as one of the Barangay in the Municipality of Mabalacat, Pampanga.</p><p>He was succeeded by Hon. Ladislao S. Miranda (1985-1993), Hon. Abelardo L. Magsino (1994-2007) and the incumbent Punong Barangay Hon. Jessie L. Duran (2007-present).</p><p>It was said that Barangay Camachiles derived its name from Camachile Trees, <em>Pithecellobium dulce&nbsp;</em>because the place is once abundant with it.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "1001",
        "name": "Dapdap",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/dapdap-logo.jpg",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>DAPDAP is a native tree. These trees were abundant and were all scattered within the vicinity thus the residents called the place Barangay Dapdap. It is one of the 27 barangays of Mabalacat City, Pampanga. It was a remote barangay with vast agricultural land, situated Northeast of Mabalacat, town a city, Province of Pampanga. First Congressional District. </p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "1002",
        "name": "Dau",
        "width": 4312,
        "height": 2868,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Dau traces its origins in 1843 when <strong >TEODORO LISING&nbsp;</strong>founded a small and sleepy community in the rolling plains some distance from the foot of the Zambales Mountain range. From its inconsequential beginnings as a mere community in the township of Mabalacat, Dau became a full-pledged Barrio in 1935 by virtue of a Commonwealth Act. It is the transitional Philippine-American government of president Manuel Quezon to which Dau owes its existence to.</p><p>In 1902, the American Army established Fort Stotsenburg in the grassy plains just across Dau started the future barrio&rsquo;s strategic importance and it contributed ultimately to the creation of the barrio in its present location. The Americans, noting Dau&rsquo;s importance, incorporated it in the planning and establishment of the military Fort by providing access to it by connecting it to the Manila-Dagupan Railroad System.</p><p>From this military roots, Dau underwent phenomenal growth even after the country gained its independence in 1946 democracy but the Americans never really left. Fort Stotsenburg, later renamed Clark Air Base, continued hosting the American military.</p><p>During World War II, Dau bore witness to battles between the imperial Japanese forces and the American colonists. Fort Stotsenburg suffered aerial attacks and later feel to Japanese land forces. After the pacific war ended, Fort Stotsenburg &ndash; now Clark Air Force Base, ushered in the US military base-dependent economy that signaled Dau&rsquo;s bright future and presage the rise of the barrio as the PX(Post Exchange) Capital of the Philippines due to the lucrative black market for US(state-side) goods.</p><p><strong>DIONISIO MENDOZA</strong> became the first Teniente Del Barrio of Dau. The country was under the grip of the Communist insurgency then and MENDOZA was abducted by armed men and disappeared, never to be seen alive again.</p><p >He was succeeded by <strong>KAPITAN DEL BARRIO</strong> in 1967 until his assassination in 1979. He was the incumbent Kapitan Del Barrio of Dau during the Martial Law Years. It was President Ferdinand Marcos who authored the shift from old Barrio to the new Barangay System. Under one of his New Society reforms, the term Kapitan Del Barrio became Barangay Captain.</p><p><strong >FRANCISCO SALUNGA&nbsp;</strong>became PRESCO&rsquo;S successor and served as Barangay Captain from 1979 until he succumbed to cancer in 1989. He was the incumbent Barangay Captain during the People Power Revolution that restored democratic freedom to the nation.</p><p>During that period, Dau grew in leaps and bounds, in terms of population and economy, owing to local migration and booming business activity. Entire communities from Angeles City and nearby towns were relocated and settled in areas of Dau now known as Dau Homesite. The new North Luzon Diversion Road, in addition to the ubiquitous McArthur Highway made Dau as central hub of transportation in Central Luzon and made easy access to Metro Manila.</p><p>The Cold War and its surrogate conflict; the Vietnam war cemented Clark Air Force Base strategic importance to the American superpower&rsquo;s execution of its foreign military policy. The US 13<sup >th</sup> Air Force was based in Clark and provided combat, logistical and R&amp;R(rest and recreation) facilities for American servicemen serving in the Indochinese campaign. It was during this period wherein Dau became the commercial center of the municipality and was even bigger and more progressive than Mabalacat itself.</p><p>In 1989, <strong>BENJAMIN M. MANLAPAZ&nbsp;</strong>was elected as Barangay Captain (Punong Pambarangay) and reinvigorated Barangay Dau with his dynamic and hands-on leadership. It was during his term that Dau reached legendary status in terms of the Katarungang Pambarangay. In 1990, (Republic Act 7160) The Local Government Code of 1990 laid down the foundations of local governments including that of the barangays. The concept and system of the Lupon Tagapamayapa was introduced and it was in this arena that Dau gained nationwide fame.</p><p>By launching massive information dissemination about the Katarungang Pambarangay and Lupon Tagapamayapa, Punong Barangay Manlapaz attained the twin objective of making the people aware of the Law and Justice and accepting the indigenous-grass roots level of conflict resolution. From thereon, Dau garnered awards given out by the Department of the Interior and Local Government for Outstanding Lupon Tagapamayapa year after year.</p><p>This string of awards culminated to the three (3) consecutive years of Most Outstanding Lupon at the National level that ultimately gave Dau the <strong>&ldquo;Hall of Fame Award &ndash; National Level&rdquo;.&nbsp;</strong>The awarding ceremony was held in Malacanang Palace by President Fidel V. Ramos himself.</p><p>In 1991, Mount Pinatubo erupted and brought utter destruction to Central Luzon. Barangay Dau and nearby Angheles City, both suffered the &ldquo;double-whammy&rdquo; of the damages brought by the Mt. Pinatubo eruption and the economic disaster of the closure of the Clark Air Force Base. But with the support and rehabilitation efforts of the national government, both local government units recovered in due time and continued their inexorable climb to progress.</p><p>In 2002, a young <strong>LOUIE P. CUNANAN&nbsp;</strong>took over as Barangay Captain. It was during his term that the present (2) storey Barangay Hall Building was constructed. He served a five (5) year term owing to an extension of term enacted by Congress.</p><p>In 2007, a new Punong Barangay was elected in <strong >MARINO &ldquo;ATLAS&rdquo; MORALES JR.,&nbsp;</strong>scion and namesake of the incumbent mayor, who has served the longest continuous tenure of any local government official. He was re-elected in 2010 and has the distinction of being the Barangay Captain of Dau when Mabalacat became a component city in 2012 by virtue of Republic Act 10164. He unfortunately lost in his third bid as Barangay Captain in 2003.</p><p>The uncumbent Punong Barangay of Dau, <strong>DR. OSCAR RICO AURELIO,&nbsp;</strong>was elected by a wide margin over his opponent in 2013. Before becoming Dau&rsquo;s 7<sup >th</sup> Punong Barangay, Doc. OCA was a three-term Municipal Councilor and later as City Councilor. He is also the incumbent Association of Barangay Councils (ABS) President and ex-officio City Councilor, a position he is very familiar with. He is also a practicing physician by profession.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "1023",
        "name": "Dolores",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>The present official name is Barrio Dolores although the Barrio has undergone two geographical phases &ndash; the Old Dolores which was founded 177 years (1776) ago and abandoned in July 1948; and new Dolores which was settled in 1948 by the people from Old Dolores</p><p>The popular name is Dolores although it is known as Engineer Bus- bus commuter or riders. This barrio was called Dolores in honor of the Patron Saint Dolores who has miraculous powers.</p><p>The Old Dolores which is now part of Clark Field Air Base included the sitios of Salbac, Biria, Biabas, Hacienda Concepcion and Talimunduc. The New Dolores (the present barrio) was once the sitios of Bana and mamatitang.</p><p>The old Dolores was established in 1776 while new Dolores was founded in 1948.</p><p >The old Dolores was founded by Jose Maria Henson from Angeles (Culiat). The barrio at that time was the meeting place of Pampangos from Angeles and Negrito hunters from the Municayu Mountains.&nbsp;</p><p>In the Old Dolores the first Tiniente or Headman was the founder, Jose Maria Henson followed by the following:</p><ol><li>Victor Tanglao, Sr.</li><li>Nicolas Henson</li><li>Pantaleon Maglalang</li><li>Cifriano Sison</li><li>Nicasio Magtanong</li><li>Mariano Tanglao</li><li>Marcelo Mejia</li><li>Venecio Tanglao</li><li>Dalmacio Concepcion</li><li>Isabelo Munoz</li><li>Eulogio Medina</li><li>Doroteo Balagtas, etc</li></ol><p>The Old Dolores, the original place where the present people of New Dolores once lived, was a rolling plain, bounded by high hills. It was once a meeting place of Pampangos and Negritos who traded cloth, wild fruits, rattan, gogo bark, deer meat, and logs. This barrio was situated near the vicinity of Fort Stotsenburg now a part of Clark Field Air Base. Salbac, a sitio of Old Dolores wa full of salbac plants; Talimunduc was so called because it was located on an elevated place, and Biria was so named because of the many biria trees there.</p><p >We come to New Dolores. This new barrio was once the sugarcane plantation of Don Marcelo Tiglao and Atty. Francisco Siopongco, Sr.</p><p >In the Old Barrio Dolores, because of its proximity to Clark Field Air Base, was once the scene of a fence battle between the Japances garrison soldiers and the American liberation forces. You will find out along the banks of the brooks and nearby hills Japanese dugouts, pill boxes and other trenches still there.</p><p >Some of the important facts and incidents that took place were the following:</p><ol ><li>Spanish Occupation &ndash; During the Revolution a Filipino contingent was organized under Bernardo Tanglao, Sr. who suffered personal indignities by the enemies because he refused to reveal the names of his companions.</li><li >During the American Occupation to World War II &ndash; As soon as peace was established by the American Civil Government people from the Poblacion, Bamban, and Angeles Began to flock to the Old Barrio where they engaged themselves in farming and the rest obtained employment in Camp Stotsenburg. While peace was everywhere, something happened in 1912 when the people were ejected from their homes by the owner of the land.</li></ol><p>Every year, the people have a barrio fiesta. Colors by parade both civic and religious, beauty contest, athletic game and be a native zarzuela, the fiesta used to be a pompous one. In every home, everybody was welcomed.</p><p >The early punishment was in human. The guilty of the criminal was given fifty (one cavan mirurungut) lashes.</p><p >One legendary figure topped all supermen of flores. He was Jose Maria Henson, the founder of Old Dolores. It was said that this man possessed a sword having a magic power. One day a traveler asked for a light from Henson to light his cigarette. Henson gave the point of his sword and the cigarette was lighted. The stranger was not to be outdone. He threw his ball of thread into the house of Henson and all of a sudden all the persons in the house were bound hands and feet. Henson in feet of hanger threw his sword at the traveler and the latter could not move.</p><p>The early people used to sing the &ldquo;dalit&rdquo;, &ldquo;basultu&rdquo;, &ldquo;passion&rdquo;, and Spanish Polkas. These songs were about the dream of a mother to have her son become a priest of Rome or a Doctor of Medicine. Some of these songs were about the bravery and strength of Bernardo Carpio, Supla-Supling, and Pugut Negro.</p><p >The games were Roman wrestling, tug of war carabao racing, &ldquo;maro&rdquo;, &ldquo;lucsuanan tinic&rdquo; and &ldquo;tucupan silim&rdquo;. With the coming of the American soldiers, the people learned to play softball, basketball, baseball, golf, and track and field.The amusements consisted of cock-fighting.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "105",
        "name": "Duquit",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Duquit is previously spelled as DUKIT and according to the elders, DUQUIT is a species of tall lean trees which made good as house, posts and sculpture is their form of livelihood; it was then headed by a chieftain today known as Barangay Captain.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "106",
        "name": "Lakandula",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Carved out of the progressive barangay Dau in the Municipality of Mabalacat, Barangay Lakandula is what was mostly a former area of land called &ldquo;Bernardo Subdivision&rdquo; currently consisting of thirteen (13) numbered parallel streets (from 7<sup>th</sup> to 19<sup>th</sup>) traversed by various horizontal streets.</p><p>With an estimated population of 4,000, Barangay Lakandula, as of 2010, gets an internal revenue allotment of around 2.7 million. Being strategically located beside Clark Freeport&rsquo;s Main Gate, the barangay is a home to numerous apartments and dormitories (I.E. bahay ni ate) of large capacities catering to the ever-growing workforce of the former airbase.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "107",
        "name": "Mabiga",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>When the president of the Philippines under the 1935 Philippines Constitution or the Governor General under the Jones Law still had the statutory power to create barrios (now barangay), pursuant to section 63 of the Administrative Code, the Secretary of the interior, as the one having direct supervision over local governments, issued a circular No. 321, dated February 17, 1938 instructing that the local authorities concerned with the creation of a new barrio furnished the following data:</p><p>Barangay Mabiga was created directly by law under the provisions of the revised barrio charter (R.A. 3590), approved on June 22, 1963. By presidential decree 557, dated September 21, 1974 the revised barrio charter was adopted as the Barangay Charter, and upon the recommendation of the municipal council of Mabalacat, Province of Pampanga embodied in a resolution approved by at least two-thirds of the entire membership of the said council. Barangay Mabiga was created with its population of 12,000 and boundary lines which separated from other barrios</p><p>Mabiga: </p><p>Due to scarcity of the official records, the origin of its name had two versions. According to the other old folks it was named after &ldquo;biga shrub&rdquo; specie of the grass family growing abundantly during early days of this place. MABIGA means &ldquo;MANY BIGA&rdquo;.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Another version of some old folks claimed that the topography of Barangay Mabiga is high flat land. And most of the time the sky was cloudy which means in Pampango dialect &ldquo;MA-BIGA&rdquo;, since then the place was called MABIGA.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "108",
        "name": "Macapagal Village",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/macapagal-logo.jpg",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>On the year 1957, Barangay Macapagal Village, Mabalacat, Pampanga was known Baluga Village (negrito village). Most of the residents are &ldquo;ITAS&rdquo;. But on 1961, the &ldquo;ITAS&rdquo; was evacuated by the Americans inside the Clark Air Base, and they left the residences which are not ITAS.</p><p >In the time of Former President Diosdado Macapagal, the official of the said place made a resolution to make it a residential place and to them to work in the Military Reservation Land of the Americans, but the Mercy of God the resolution was approved. In that time the people were able to have their Barrio Election. And they also built Barangay Hall, Chapel and School</p><p>The people live quietly in the place but on 1975, government under the Former President Ferdinan Marcos, ordered the residence to evacuate in a Resettlement in Sacobia as well as the residence in Brgy. Marcos Village but the of DAR, Mr. Onopre D. Corpuz President DAP and Mr. Jose M. Grisol, undersecretary of DND for them to be able to stay in that place. And they made a letter to Pres. Marcos on October 10, 1975.</p><p>And the letter was answered by Mr. Jacobo C. Clave, Prsidential Executive Assistant, on December 29, 1975 states that the residence of Brgy. Macapagal Village can stay and work in the reservation land.</p><p >The residence continue to live peaceful and quiet. Until the eruption of Mt. Pinatubo on June 12, 1991, Almost of the residence were affected as well as their work especially in the farm. This is because the Barangay was destroyed by the flow of Lahars, But when the people come back for their farms the Clark Development Corporation already allow Fontana Gold Course and Hacienda Golf Course and County Club to rent the place.</p><p>As of now the total household was 745 with 3,266 Population, the property of Barangay Macapagl Village is 160 hectares.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "109",
        "name": "Mamatitang",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Mamatitang is one of the twenty seven (27) barangays of Mabalacat.&nbsp;By the year 1903, when Mabalacat increased its population into 7,409, nineteen (19) barangays were already created and Mamatitang is one of them.</p><p >Barangay Mamatitang acquired its name from the wealthy family settlers named &ldquo;Titang&rdquo; and mama was called to the wealthy Titang. That&rsquo;s the name Mamatitang came from.</p><p>Before the Japanese occupation in the Philippines, Mamatitang has vast agricultural land which contains mostly one thousand five hundred hectares (1, 500 ha.). This includes the land from barangay San Joaquin, Cacutud, Atlu-bola and part from barangay Mangalit. When the American forces helped defended the Philippines, it built military bases which called the Clark Air Force Base which is now the Clark Freeport Zone. The areas that they occupied are the old San Joaquin and Dolores.</p><p >Presently, barangay Mamatitang has approximately fifty-five hectares (55 ha.) including residential and agricultural areas.</p><p >The family who early resides at barangay Mamatitang are the Galang, Medina, Santos, Nalo, the Balilo, Siopongco, and the Garcia&rsquo;s and other settled during the Ventura Santos owned more than half of the land of the barangay and the Siopongco&rsquo;s owned almost one-fourth of the residential land.</p><p >Barangay Mamatitang also has its leaders like the Cabeza de Barangay, Tiniente del Barrio, Barangay Captain and now the Punong Barangay. The known leaders at that time are Teodulo Garcia, Gelacio Balilo, Castor Dizon, Carlos Magtoto, Ruben Isais, Reyes Delos Reyes, and now the incumbent Punong Barangay Honorable Eliser S. Lacsamana. Former Vice Mayor Paquito G. Delos Reyes and Vice-Mayor/Mayor Reynaldo &ldquo;Moc&rdquo; Candelaria are residents of Barangay Mamatitang.</p><p>The Don Teodoro V. Santos Institute, formerly, Mabalacat Institute was founded through the initiative of the son of Dona Africa with the cooperation of the tenant farmers tilling farm lots at Barangay Mamatitang, Barangay Cacutud.</p><p>Other schools are the Barangay Development Center, formerly, Day Care Center and the Mamatitang Primary School. Barangay Mamatitang has approximately three thousand (3,000) in population and one thousang four hundred (1,400) are registered voters.</p><p >People of Barangay Mamatitang are considerably religious. Catholic religion is dominant in the barangay. They built the Chapel of San Roque in honor of the Patron Saint with the same name. They celebrate the feast of San Roque every August 15 and 16 of the year. Other religions are Baptist, Seventh Day Adventist, Protestant and others.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "110",
        "name": "Mangalit",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Mangalit is a barangay of the Philippine Municipality of Mabalacat in the province of Pampanga in central Luzon which is part of the Luzon group of islands. The municipality of Mabalacat with a population of about 203,307 and its 27 barangays belong to the urban areas in the Philippines. Mangalit had 617 residents by the end of 2007.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "111",
        "name": "Marcos Village",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p >Noong unang panahon ay nasa mga bulubundukin ng MARGOT at sapang bato ang mga AETA silay nabubuhay sa pamamagitan ng pagtatanim ng gabi, palay at kamote. At sa pamamagitan ng pangangaso nila ay nakakatikim sila ng mga karne ng usa, ahas at mga baboy damo. </p><p>Malapit sila sa kabihasan pero wala pang isa man sa pamilya nila ang nakakapag-aral sila ay may mga kultura na sila mismo ang gumawa tulad halimbawa ng pakikipag kasundo sa anak nilang babae o lalake sa mga kapwa nila katutubong AETA. </p><p >At meron di silang batas na pansarili na kapag nakapatay ang isang tao ay kailangang buhay dn ang kapalit. Unang alalagak sa hukay ang pi&ntilde;ata at sa ibabaw ay ang pumatay. </p><p>Meron silang kalipunan na ang namamahala ay nangngangalang MAURICIO LAXAMANA, ito ay kanilang sinusunod, payak ang kanilang pamumuhay at ang pinahkukunan nila ng tubing na maiinom ay galling sa batis sa mga sibol wala silang pinupuntahang mga hospital kapag merong nagkakasakit mero silang pinaka albolaryo at sa pamamagitan ng tinatawag na dagaw ay kanilang ginagamot, ang mga may sakit kung minsan sinasayawan nila ang mga may sakit at nakasuot ng bahag at nagaalay ng putting manok bilang pasasalamat. </p><p>Dumating ang ikalawang digmaang pandaigdig at sila ay nagsipag tago sa kabundukan kasama nila sa bundok ang kanilang pinuno nasi MAURICIO LAXAMANA ang kanilang tinatawag na DATU CHIEF. </p><p>Sa pagtatago nila ay may natulungan silang mga sundalong amerikano na si CAPT. CANER at CAPT. BROS. Pinakain nila ito at ginamot, noong maitaboy ng puwersang amerikano at ang mga hapon ay pinasalamatan sila ng gobyernog amerikano, isa sa pinakamatanda ng tribo ang ginawa nilang king alfonso at queen mary ang kanyang kapatid na babae. </p><p>At isa rin ang nagmalasakit sa mga maerikano ang bininyagan nilang prime minister kudiaro laxamana at inilipat sila sa magandang lugar at tinawag nilang macapagal village. </p><p>Gusto ng mga amerikano na walang kasalamuhang hindi kulot ang mga katutubo at dito ay binigyan sila ng karapatan na magpa ospital sa loob ng clark air base tuwing may sakit. </p><p>Binigyan din sila ng ikabubuhay na tinatawag na nilang sanitary land fill nakakapulot sila ng mga tanso, aluminyo at karton na kanilang ibenebenta. </p><p>Sa pagdaan ng panahon ay nakaramdam ng katandaan si datu chief maurico laxamana kaya inilipat niya ang pamumuno kay Isaac lumanlan at sa dahilang dumadami ang mga humahalong mga unat ang buhok kaya inilipiat na naman sila sa tinatawag na san Joaquin sa mabalacat at tinawag nila itong san Joaquin village. </p><p >Dito ay binigyan sila ng family pass ng amerikano na may litrato ng buong pamilya upang makadaan sila palabas at papasok sa mabalacat gate papasok ng village na binabantayan ng mga sundalong amerikano. </p><p >Ngunit sadyang marami ang nagnanais na unat sa mga aeta dahil sa kanilang hanap buhay na galing sa sanitary land fill kaya inilipat na naman sila sa tabi ng bakod ng base na tinatawag nilang negrito village, tulad sa san Joaquin ay ipinagpatayo sila ng paaralan, simbahan at klinika na pwede nilang takbuhan sa simpleng gamutan pero sa oras na kailangan ng maospital ay agad din silang itinatakbo sa base hospital. </p><p >Nagiging Masaya at magaan ang pamumuhay nila dito at dahil marami ng natutunan ang mga katutubo ay natuto silang mamulitika, dito sila nakaisip na bumoto ng mamumuno sa kanila sa pamamagitan ng buto ng patani, naglalagay sila ng litrato ng mga iboboto sa mga garapon at mula sa tinente del baryo hanggang sa mga konsehal ay inaabutan sila ng walong pirasong buto at sila ang nahuhulogan sa garapon na kanilang gusto. </p><p>At ito na nagpapaubaya ang mga amerikano sa estilo ng kanilang pamumuhay na natutuhan nila, at hindi na nabawalan ang iba&rsquo;t-ibang klase ng mga tao na humalo at nanirahan sa village. </p><p >Ipinaresiklo nila ang negrito village bilang marcos village dahil kasalukuyang president ng bansa si pangulong Ferdinand marcos hanggang dumaan ang panahon at napalitan ang mga henerasyon at lalong marami ang namumulitika naghahangad ng magandang pwesto sa pamamagitan ng halalan.</p><p >Mula kay kapitan caner laxamana nahalal nasi anastacio Serrano, sumunod na umupo sa pwesto si vigor laxamana at noong panahon ni pangulong cory Aquino ay umupong isang termino si ginang Rosalina ajos, sumunod na halalan ay si Roberto bernardo sa tatlong termino at ilang taon ding napagtagumpayan ng makaupo si bonifacio estanislao at sa kasalukuyan ay si chairman jose jerry m. dacio sila ay pawing mga unat ang buhok at ilan lang sa mga katutubong aeta ang nagtagumpay na makaupo sa pwesto.</p><p>At ngayon ang tinaguriang marcos village ay isang Masaya at mataong baryo na ang karamihan sa mga nakatira ay nagtatrabaho sa clark air base na iniwan ng mga amerikano.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "112",
        "name": "Mawaque",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>The name Barangay Mawaque is derived from the work &ldquo;makawaya&rdquo;. It was once a secluded place with houses made of &ldquo;bungalow&rdquo;. &ldquo;sawali,&rdquo; and bamboo.</p><p >The patron saint of Barangay Mawaque is Sta. Teresita. Based from stories of the elders, Sta. Teresita was seen from a far and henceforth became their patron.</p><p  >Agriculture is the primary source of income in the barangay. The residents are farmers of corn(maiz), bitter gourd (ampalaya), (sitaw), and (talong) which they use as capital to sustain their needs and as addition to their savings. They farm in almost one hundred sixty (160) hectares of land and harvest 50-80 tons of rice</p><p>Barangay Mawaque can be seen as 5.3km away in the Mabalacat City map. Because of its distance from the main roads and civilization itself, the barangay was considered as old-fashioned, unorganized, and outdated. The residents back then lived a simple and peaceful life. Time has passed and with the help of new technology, the barangay is now at par with the latest knowledge and innovation.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "113",
        "name": "Paralayunan",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Ayon sa salaysay ng mga matatanda dito sa aming barangay, dati raw ang PARALAYUNAN ay tinatawag na GUYUNG-GUYUNG. Sabi nila na ang Mahal na Patron ng SAN ANTONIO DE PADUA at SAN ISIDRO DE LABRADOR ay nakipaglayunan daw sa Guyung-Guyung (layunan-ibig sabihin nakatira). Magmula raw noong makitira ang dalawang Santo sa guyung-gyung pinalitan na ng mga tao ang pangalan ng lugar sa BARANGAY PARALAYUNAN.</p><p>Ito ang kwentong nakagisnan ng mga tao ditto kung saan at paano nagging PARALAYUNAN ang aming baranagay.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "114",
        "name": "Poblacion",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Poblacion is located at the center of the City of Mabalacat, it is as well the capital of the City, Barangay Poblacion was established on the year 1712, it is also one of the first five established barangay in mabalacat. The known Our Lady of Grace Parish Church can be found &nbsp;here which is one of the biggest churches in Pampanga, also the first Elementary School in Mabalacat which has been the occupying force of the Spaniards way back on World War II was situated here.</p><p>Barangay Poblacion was also one of the affected areas during the volcanic eruption of Mt. Pinatubo, but because of the diligence and perseverance of the living here, Barangay Poblacion had adjusted and regains its livelihood. The lives of the people living in Poblacion went industrialization for the base of the American Soldiers; this event serves an opportunity to the people living in poblacion to settle in a job.</p><p>In present time, Poblacion is one of the barangay&rsquo;s which has good record not hust in physical aspect but likewise in all in tenure.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "116",
        "name": "San Francisco",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>About the middle of the eighteenth (18<sup>th</sup>) century the town of Mabalacat under the administration of a negrito chief named Captain Caragan. This chieftain, according to information appointed another negrito, who&rsquo;s nobody, would remember as barrio lieutenant of this place during the administration of Captain Caragan, the parish priest assigned in the loving friar who donat &nbsp;VISION.</p><p >It was from this time of the barrio patron saint that the barrio got its name. San Francisco had ever since two (2) Sitio&rsquo;s located in the easthern of the barrio.</p><p >Talimundoc got its name from the high elevation of the place. Talimundoc means a lovely bamboo grove. As there was only one bamboo grove growing in the place, the Sitio was called Cuayan a Bugtong.</p><p >The friar priest, a Spaniard, was responsible for the construction of the first catholic cemetery located just a stone throw from the market place. This catholic cemetery was closed for a very long time and replace by municipal cemetery located in the southwest of the market building along the railroad station. The barrio San Francisco has been indeed very lucky for the construction. It is said that these two (2) edifices were constructed in the year 1902. The construction of the national highway which passed through the barrio and runs from south and north and contributed to the increase of its population. Many people from other barangay migrated to this barangay and constructed permanent homes. The public market located also in the barangay was one of the factors that increase the population. Most of the sellers and storekeepers in the market are from this barangay. The barangay is traversed by a brook name Quitangil. This brook runs from west to east. In the past the people used to catch fish using a line called Quitang. Quitang composed of many hooks. Many people used this method of catching fish and there were many quitang along brook was called Quitangil.</p><p>In the later part of the Spanish occupation in sugar mill was established beside the Quitangil brook. It was that this sugar mill was run by water power whose source of energy was a brook. The sugar mill continued to function until 1916.</p><p>During the Spanish tie there was a sort of school called &ldquo;Bantayan&rdquo;. The Bantayan was a certain place on the ground which roofs but no walls and taught by a certain lame man named Apung Beltong Pile. This teacher taught children reading, writing, praying, arithmetic, and catechism. The children were well discipline and very much fear of the man, Apung Beltong Pile, he was very strict. He used to punish his pupils offenders by having kneel them on mongo beans for few minutes, by beating them with a peril, by having them to make stunts like catching dragonflies or telling to stretch their hands sideward straight for a long time.</p><p>Barangay San Francisco is situated exactly ninety three kilometers (93) north of Manila. It is one of the developed barangay of the Municipality of Mabalacat. It serves as the transit for economics, trades and industrial transactions because it covers in its territory the public market and access road to Clark Special Economic Zone.</p><p>Many residents of the barangay are divided into eight (8) puroks. It has six (6) schools, three (3) owned by group of individuals and the other three (3) by Barangay Day Care Center which is subsidized by the government, Saint Anthony Technological College, Children of Fatima, School of the Infant Jesus and Nehemiah.</p><p>Barangay San Francisco is situated on the northern part of the Municipality of Mabalacat. It is bounded on the north of Barangay Poblacion; on the south of Barangay Sto.Rosario; on the west by Clarkfield; and on the east by Barangay Sta.Maria.</p><p>It has a total land area of 129,783 square meters. San Francisco is approximately 1km away from Poblacion. Its topography is generally flat and its type of soil is sandy loam. It has two (2) creeks on the boundary of Mabiga and San Francisco.</p><p>The climate/weather is similar to the other Barangays of Mabalacat City and other towns. It has two (2) the wet and dry seasons. The months of May to November are considered the wet seasons while the months of December to April are the dry season.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "117",
        "name": "San Joaquin",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay San Joaquin is approximately 26.7 km. away from Provincial Capitol, 1.5 km. away from Municipal Hall and 500 meters away from National Highway. It is bounded on the North by Barangay Dolores, on the South by Barangay Poblacion, on the East by Barangay Mamatitang and on the West by Clark Special Economic Zone, all of Mabalacat.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "118",
        "name": "Santa Ines",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Since Mabalacat was found, Barangay Sta. Ines was considered one of the first barrios of Mabalacat. It was considered in the year 1890. The first living people in the barrios and to other barrios were Aetas. 80% of the land of Sta. Ines was rice field and only about 120 households are living in this barrio. One of the very first families who settled in the barrio was Dela Cruz Family. A very well-known and wealthy clan, who owns 60% of the total land area of the barangay. Because of their power, the Dela Cruz family resettled all the Aetas to nearby areas like Porac, Pampanga. The family has a Patron Saint St. Agnes (Sta. Ines).</p><p>Liberation came many resident of Sta.Ines found employment at Clark, Airbase. A few years later, in early 1950&rsquo;s their primary school was established. The pioneer teachers were Mrs. Concha Dizon, Ms. Datu and Ms. Angeles Magat. It was during this period that the Sta.Ines residents enjoined some form of hope and economic resurgence.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "119",
        "name": "Santa Maria",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Sta.Maria was named under its Patron Saint Maria Magdalena under the care of the prominent person Alejandrino Angeles. Originally, the Barangay proper has only 2 households, Sitio Libutad has 19 and Sitio cuatro has 4.</p><p>Before the war in 1930, there was no designated Barangay Captain. The town official only communicated directly to the landlords.</p><p>After the 2<sup>nd</sup>&nbsp;world war in 1941, there was appointed official called &ldquo;TINYENTE DEL BARYO&rdquo; and he was appointed by the Town Mayor. Tinyente del Baryo is the head of the Barangay that time and no other official aside from himself.</p><p>When the Barangay Code was administrated, the Barangay Officials are now elected which is the Barangay Captain and 5 members of the council and he will get or appoint Secretary and Treasurer.</p><p>1<sup>st</sup>&nbsp;Tinyente Del Baryo was Mr.Ananyas Galang. Next to him who was appointed was Mr.Licup.</p><p>In addition, Mr.Elpidio Sarmiento was appointed by the people in Sta.Maria in year 1986 &ndash; 1989 during the time a problem in the local government.</p><p>There was no Barangay Hall at that time. Meetings were held to different household. Later on, meeting was moved to the chapel, Sta.Maria Magdalena Chapel. During the time of Hon. Bienvenido Manalo, he was able to start and built a small barangay hall at Sitio Libutad. From then, meeting was moved from chapel to the Barangay Hall. After the small barangay hall, a newly and developed barangay hall was built under the time of Hon.Cesar G. Manalo and roads were also concreted. Until present, the said newly developed Barangay Hall still exist in which election been held.</p><p>Means of livelihood that time was 98% agriculture and 2% laborer. But in today&rsquo;s generation, it is 40% agriculture and 60% laborer.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "120",
        "name": "Santo Rosario",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>It was early year of 1960 under the administration of&nbsp;<strong>PRESIDENT DIOSDADO MACAPAGAL</strong>. During that time there was a program of the government regarding certain requirement to a place tp be considered as a community. One factor that has to be considered were the population of the said place, the majority of the inhabitants to become independent and the capability of a certain group of people to be able to extend responsible governance on the establishment of a community. All obligation on the organization of a Barangay were convene, that started the composition of&nbsp;<strong>BARANGAY SANTO ROSARIO</strong>&nbsp;which was sited as one of the Sitio of Barangay San Francisco by that time. It was the aspiration of the people of Barangay Santo Rosario that relent an opportunity to build their own society to measure the competency on their gallantry.</p><p><strong>The naming of Barangay Santo Rosario</strong></p><p>There was a certain religious person named&nbsp;<strong>MR. PEDRO DIZON</strong>&nbsp;who donated a Patron Saint name SANTO ROSARIO by the people of Mawaque were terrified by the war, the rationalization why they migrated in Barangay Santo Rosario. When Mr. Pedro Dizon passed away all his belongings were left to her daughter who lived in Barangay Santo Rosario name Mrs. Juanita Dizon who decided later on about the naming of the said barangay under the name of the&nbsp;<strong>PATRON SAINT SANTO ROSARIO.</strong></p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "121",
        "name": "Sapang Balen",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabalacat-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Sapang Balen is approximately 37 km. away from Provincial Capitol, 7 km. away form City Hall and 7 km. away from National Highway. It is bounded on the North by Barangay Atlu-Bola and South of Barangay Poblacion on the East of Barangay Mangalit and on the West of Barangay Bundagul, all of Mabalacat.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "122",
        "name": "Sapang Biabas",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/sapangbiabas-logo.jpg",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Before the Japanese Forces occupied the Philippines in 1941, there were almost 200 houses/families according to old folks who still reside in this barangay. Sapang Biabas is composed of three Sitios namely: Sitio Mauli, Barangay Proper, and Sitio Makabakle.</p><p>Tolentino, David, Espino and Feliciano families occupied Sitio Mauli. At the barangay proper, you will locate the Nacpel and Madlambayan families. At Sitio Makabakle, the families of Ga&ntilde;a, Tiglao and Diglao are located in.</p><p>&nbsp;Their means of livelihood and industry comes mostly from tilling the land. Farming is the main employment and activity of the inhabitants. A Barrio Lieutenant leads the barangay and is an elected official. The first Barrio Lieutenant elected was Eulogio Santos, who was succeeded by Feliciano Magsino, Simplicio David, Felipe Salta, Leonardo Cunanan, and Eusebio Liwanag. Eusebio Liwanag was gun down and assassinated at Sitio Maria Consolacion of Barangay Dau, after attending a wedding party of his relative.</p><p>Then Mabalacat Mayor Hon. Wilfredo Halili appointed Leonardo M. Miranda as Officer-in-charge during the Martial Law regime (Sept. 1972-1986) under the leadership of then President Ferdinand E. Marcos, the then elected first kagawad declined the position and so Leonardo M. Miranda became the successor of Eusebio Liwanag. After the Martial Law (Feb. &rsquo;86 &ndash; EDSA Revolution), Tomas G. Espino Sr. replaced Leonardo Miranda during the revolutionary government of then President Corazon Aquino.</p><p>According to the people in the early days, there was a small river along the side of the main road and its water is free flowing. On the both sides of the river, you will catch a sight of many wonderful and growing guavas bearing enormous fruits and on this side were the small children mainly boys pasture their carabaos. The river was very clean and the water is crystal-like and can be used as mirror. The water coming from the river can be consumed as drinking substance as well for washing clothes. During summer when the weather is hot and the water is cold enough, people of the said barangay, go out to refresh and bath at the river and at the same time have fun with their family. Before the explosion of Mt. Pinatubo, there were only 200 registered voters and approximately 600 residents living in the barangay.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    },
    {
        "id": "123",
        "name": "Tabun",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/tabun-logo.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Long time ago, Barangay Tabun, was divided into four (4) sitios: Sitio Apitan, Sitio Iba, Sitio Irong (a.k.a Donya Africa), and Barangay Tabun.</p><p>A hill where a vacation house owned by Honorio Santos and his wife, Do&ntilde;a Africa, was situated in the midst of the sitios. The Santos family was once the owner of almost three hundred and twenty (320) hectares of land surrounded by rice paddies and sugarcanes.</p><p>Barangay Tabun symbolizes the vast storage of water supply of all the farmers living in the area for most of the residents work in the agriculture field.</p><p>In the year 1946 when the heat between the government and the &ldquo;Guirila&rdquo; group was at its peak, the residents&nbsp; Sitio Iba were forced to evacuate and relocate to their neighboring sitio, Barangay Tabun.</p><p>In 1960&rsquo;s Enrique Garbo Become the first Tinyente Del Baryo or &ldquo;Barangay Captain&rdquo; from Sitio Irong. He was succeeded by Ben Pangan who headed the very first &ldquo;Fiesta ng Baryo&rdquo; in a three-day celebration. During Pangan&rsquo;s leadership, He headed the establishments of a church named after Apu Lourdes from Sitio Iba and held a feast on February 14. at present day time, Barangay Tabun&rsquo;s&nbsp; fiesta is celebrated on May 15 known as Feast of San Isidro Labrador.</p><p>Ben Pangan was succeeded by Kapitan Abelino Garcia in November 11, 1968 through barangay election. However, Kapitan Garcia retreated from office because of the proclamation of &ldquo;Martial Law.&rdquo; Being the first Kagawad, Servillino Datu took his place as the new Kapitan.</p><p>When Mount Pinatubo of Zambales erupted in the year 1990, Barangay Tabun turned into a land covered with volcanic ash and lava and the residents were forced to evaluate to different resettlement areas namely:&nbsp; Mauaque Resettlement, Phase 1 and Phase 2 Camachiles, Mabalacat, Pampanga. Many years have passed after the tragedy and through the efforts of Kapitan Gerlado De Leon, Barangay Tabun rose again.</p><p>In 2002, Ador Pascual was elected as kapitan and served for eight (8) years. He was then succeeded by Ranie O. De Leon in 2011 and served until 2013.</p><p>At present, the efforts of Kapitan Jerry Magsino towards his constituents as the current Barangay Captain is being appreciated.</p>"
            },
            {
                "type": "First Family Residence",
                "content": "Sample Content"
            },
            {
                "type": "Fiesta",
                "content": "Sample Content"
            },
            {
                "type": "Branding",
                "content": "Sample Content"
            },
            {
                "type": "Politicians",
                "content": "Sample Content"
            }
        ]
    }
]