[
    {
        "id": "0",
        "name": "Atlu-Bola",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/atlubola.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Atlu Bola was formerly named as Barangay San Isidro, It was named after our patron <strong>Saint San Isidro Labrador</strong>.This barrio was under the jurisdiction of Barrio Mamatitang. It was founded in 1852 by <strong>Virginia Gomez</strong> and <strong>Tiring Mercado.</strong></p><p>Tiring Mercado, the original founder of the place built a stone sugar mill with three stone rollers which had the shape of a ball. The place had no name of its own at that time, the laborers and the people living in it decided to call it &nbsp;<strong>ATLU-BOLA.</strong>The old citizens of our barangay decided to adopt its festival date which we annually celebrating every <strong>May 15.</strong></p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Fiesta",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Vision:</h3><p>Barangay Atlu Bola Mabalacat City Pampanga, is a progressive and well preserved Barangay, in providing better services and with our various projects to our COMMUNITY PEOPLE AND WITH THE RESPONSIVE GOVERNANCE AND TRANSPARENCY OF OUR BARANGAY OFFICIAL IN SERVING OUR CONSTITUTIENTS IN THE COMMUNITY.</p><h3>Mission:</h3><p>Baranagay Atlu Bola, Mabalacat City, Pampanga, commits and strives to achieve service satisfaction and to improve our community with our organization and in structural system of governance. And to promoted transparency and strengthening law enforcement. Builds and promotes our barangay as partner of socio economic development community thru the partnership of the national government, local government, NGO&rsquo;s and other various sectors.</p>",
                "images": [
                    "assets/barangay-logos/atlubola.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "1",
        "name": "Bical",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/bical.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>This barrio is divided into parts by a stream, a part of which runs near the middle of the barrio. Named after a specie of sugarcane, &ldquo;<strong>bical</strong>&rdquo;, a slender, climbing bamboo. The patron saint in the barrio is <strong>Saint Roque</strong>, commonly called <strong>Duqui</strong> or <strong>Apung Duqui</strong>. It is from this word Duqui where the word Duquit was derived.</p><p>This place was originally called <strong>Duquit</strong>. And now duquit is one of the sitios of&nbsp; bical. The other sitios are Dalan a Bayu and Suma&ntilde;gid Dalan. It is said that barrio Bical was founded in <strong>1840 </strong>by <strong>Luis Narciso</strong>, <strong>Mateo De Leon</strong> and <strong>Manalang</strong>.The first settlers was the <strong>Narciso, De Leon</strong>, <strong>Manalang</strong> and <strong>Anunciacion</strong>.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Mission:</h3><p>Towards ourvision, the government and the people of Barangay Bical shall strive progress and change thru the use of its limited resources without having to compromise our usefulness and productiveness for future generation.</p><h3>Vision:</h3><p>We envision to live as economically empowered people led by a dynamic and proactive leadership, living in a democratic, peaceful and progressive barangay and environmentally sustainable community.</p>",
                "images": [
                    "assets/barangay-logos/bical.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "10",
        "name": "Bundagul",
        "width": 2500,
        "height": 1667,
        "logo_url": "assets/barangay-logos/bundagul.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Formerly, this was called &ldquo;<strong>Masulput</strong>&rdquo; meaning plenty of amorseco weeds. Named after <strong>Maria Dagul</strong>, one of the first female settlers. The early settlers were <strong>Miguel Buyson</strong>, <strong>Gregorio Buyson</strong>, <strong>Tomas Buyson</strong> and <strong>Maria Dagul</strong>. People in bundagul were mostly farmers and peace-loving.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Mission:</h3><p>Brgy.Bundagul will provide a progressive, clean and crime free community thru an effective and honest local government service.</p><h3>Vision:</h3><p>We envision Barangay Bundagul, as a progressive, clean, crime free and environment friendly community with god loving people under honest and responsible public officials.</p>",
                "images": [
                    "assets/barangay-logos/bundagul.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "100",
        "name": "Cacutud",
        "width": 2500,
        "height": 1656,
        "logo_url": "assets/barangay-logos/cacutud.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Formerly, this was a sitio of Mamatitang. The people of Cacutud were known for &ldquo;<strong>pagkukutud</strong>&rdquo; or they cut woods to be used as &ldquo;<strong>uling</strong>&rdquo; from this the name of the barrio was derived. Named after &ldquo;<strong>cutud</strong>&rdquo;, the act of cutting down trees or overgrown grass like bamboo, cogon or talahib.</p><p>The people of this barrio were mostly farmers. Every <strong>31<sup>st</sup> of May</strong>, the people celebrated the barrio feast and also they celebrate the birth of their patron, <strong>Patron Apu San Roque</strong> every <strong>16<sup>th</sup> of August.</strong></p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Mission:</h3><p>The Barangay Cacutud at Mabalacat City together with partner agencies concerned with the active support of the residents shall mobilize its resources for the development and progress of the barangay.</p><h3>Vision:</h3><p>We envision Barangay Cacutud with to be God loving people, will be more educated, well-informed, and healthy and empowered under transparent governance that live in a safe and progressive community.</p>",
                "images": [
                    "assets/barangay-logos/cacutud.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "1009",
        "name": "Calumpang",
        "width": 5626,
        "height": 3635,
        "logo_url": "assets/barangay-logos/calumpang.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Named after the calumpang tree <strong>(arbol de primer orden cuyo fruto es util en la tintoneria segun la Flora</strong><strong>)</strong>. It was early year of <strong>1950</strong>. During that time, there was a program of the government regarding certain requirement to a place to be considered as a community. The majority of the residents are <strong>AETA</strong>. To all obligation on the organization of a BARANGAY were convene, that started the Composition of BARANGAY CALUMPANG.</p><p>It was the aspiration of the people of BARANGAY CALUMPANG that relent an opportunity to build their own society to measure the competency on their gallantry.The boundary dispute not with standing, Barangay Calumpang remains within the territorial jurisdiction of the City of Mabalacat, although one establishment named Paradise Ranch, owned and operated by <strong>Eric Gomez</strong>, an American citizen reportedly manifests its allegiance to the town of Bamban where he pays the traditional taxes and permits.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3><strong>Vision</strong><strong>:</strong></h3><p>To consider the stand of the loyal and cooperative on the shoulders of the people in an orderly manner. Encourage each other to take mutual action for the promotion of a better future in order to have a peaceful and with a golden grain of hope, generous in tandem towards further development with dignity, trust and full-fledged management.&nbsp;</p><h3><strong>Mission:</strong></h3><p>Keep an impact, have a heart of leadership, fear God, serve wholeheartedly to advance promote a different kind of standard of living through proper service, clear, clean and honest tenure in accordance with the law. Realize a peaceful community that is only love, tolerance and equal justice for all who exist and will prevail. Work together and participate in good relations, implementation of programs and projects for the betterment of our community. Preserve and cultivate the grace of God's gift.</p>",
                "images": [
                    "assets/barangay-logos/calumpang.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "1000",
        "name": "Camachiles",
        "width": 5626,
        "height": 3635,
        "logo_url": "assets/barangay-logos/camachiles.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>During the <strong>1960&rsquo;s</strong>, Barangay Camachiles was just a territorial enclave (Sitio) that forms part of Barangay Mabiga, form the then Municipality of Mabalacat, Pampanga. <strong>Hon. Manuel M. Dizon</strong> became the <strong>first Tiniente Del Barrio</strong> in <strong>1960 </strong>until <strong>1965.</strong> He continued to hold the office until <strong>1967</strong>, now as Punong Barangay l; retaining the same functions and powers, but changing his official title by virtue of the Democratic Rule during the Presidency of Ferdinand E. Marcos. He was succeeded by <strong>Hon. Marcelino P. Tique (1967-1972)</strong> and <strong>Hon. Dionisio P. Magsino (1973-1982)</strong>.</p><p>It was during the time of <strong>Hon. Pacifico F. Gonzales (1983-1985)</strong>.It was said that Barangay Camachiles derived its name from <strong>Camachile Trees,&nbsp;Pithecellobium dulce</strong>&nbsp;because the place is once abundant with it.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<p><strong>6 HUMAN</strong> - Symbolized the 6 Purok of Camachiles.</p><p><strong>JUSTICE SALE LOGO</strong> -Symobolized the fair justice and treatment to all.</p><p><strong>UNITY CHAIN&nbsp;</strong>- Symbolized the <strong>UNITY,SOLIDARITY and TEAMWORK</strong>.</p><p><strong>CAMACHILE TREE</strong> - Symbolized the history of CAMACHILES.</p><p><strong>Vision</strong></p><p>We envision Barangay Camachiles as a peaceful community, where love, goodwill and fair justice consistently prevail. We seek to build a God-fearing and humane community where everyone is caring, disciplined and gearing towards progress.</p><p><strong>Mission</strong></p><p>To become an effective and conscientious administration. To appropriately and effectively serve and deliver proper services to the barangay and encourage every constituents to maintain orderliness and cleanliness of the community towards further progress.</p>",
                "images": [
                    "assets/barangay-logos/camachiles.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "<ul><li>Hon. Manuel M. Dizon &ndash; 1960 - 1967</li><li>Hon. Marcelino P. Tique &ndash; 1967 - 1972</li><li>Hon. Dionisio P. Magsino &ndash; 1973 - 1982</li><li>Hon. Pacifico F. Gonzales &ndash; 1983 - 1985</li><li>Hon. Labislao S. Miranda &ndash; 1985 - 1993</li><li>Hon. Abelarbo L. Magsino &ndash; 1994 - 2007</li><li>Hon. Jessie L. Duran &ndash; 2007 &ndash; up to present</li></ul>",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Manuel M. Dizon",
                        "year": "1960 - 1967"
                    },
                    {
                        "name": "Hon. Marcelino P. Tique",
                        "year": "1967 - 1972"
                    },
                    {
                        "name": "Hon. Dionisio P. Magsino",
                        "year": "1973 - 1982"
                    },
                    {
                        "name": "Hon. Pacifico F. Gonzales ",
                        "year": "1983 - 1985"
                    },
                    {
                        "name": "Hon. Labislao S. Miranda ",
                        "year": "1985 - 1993"
                    },
                    {
                        "name": "Hon. Abelarbo L. Magsino ",
                        "year": "1994 - 2007"
                    },
                    {
                        "name": "Hon. Jessie L. Duran ",
                        "year": "2007 – up to present"
                    }
                ]
            }
        ]
    },
    {
        "id": "1001",
        "name": "Dapdap",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/dapdap.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>DAPDAP is a <strong>native tree</strong>. These trees were abundant and were all scattered within the vicinity thus the residents called the place Barangay Dapdap. The founding year of Dapdap is <strong>1838</strong> and&nbsp; also&nbsp; early name of&nbsp; this barrio is Sapang Dapdap. Early sitios include <strong>Mawaque </strong>and <strong>Caldera</strong>. The patron saint of Dapdap is <strong>Virgen Del Rosario. </strong>After the Mount Pinatubo eruption of 1991, a resettlement area was created from a part of the sugar plantation owned <strong>by John Santos</strong>.</p><p>Now known as <strong>Madapdap Resettlement Center</strong>. The early settlers were <strong>Miguel Tolentino</strong>, <strong>Alejandro Julian</strong>, <strong>Tomas Tolentino</strong>, <strong>Jose Tiamson</strong>, <strong>Vicente Policarpio</strong>, <strong>Pedro Policarpio</strong> and <strong>Jose Torres</strong>.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Vision</h3><p>Barangay Dapdap is envisioned to be a place where in the citizenry should enjoy high quality of life and where economic development will be highlighted, uplifted and wealth will be equitably distributed, that will also set aside the perceived shortcomings and will be immediately added to the accomplishment and achievement of the barangay government to a liveable place.</p><h3>Mission</h3><p>Stakeholders and people empowerment shall become prime movers and advocate of social economic progress to deliver basic needs to the community so that all shall live peacefully and harmoniously.</p>",
                "images": [
                    "assets/barangay-logos/dapdap.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "1002",
        "name": "Dau",
        "width": 4312,
        "height": 2868,
        "logo_url": "assets/barangay-logos/dau.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Dau traces its origins in 1843 when&nbsp;<strong>TEODORO LISING&nbsp;</strong>founded a small and sleepy community in the rolling plains some distance from the foot of the Zambales Mountain range. This barangay named after a <strong>large hardwood tree</strong>, <strong>Dao</strong> or <strong>Dau</strong> (<strong>Dracontomelon Dao</strong>).Its early sitios included the densely-forested <strong>Bangkal</strong>, <strong>Camatsiles</strong>, <strong>Gasdam </strong>and <strong>Camias</strong>. The <strong>Sansons </strong>or <strong>Samsons</strong> were prominent residents and the pious Dona Cecilia Samson donated the Dau Village Chapel.</p><p>In the <strong>1960&rsquo;s</strong>,&nbsp;<strong>DIONISIO MENDOZA</strong>&nbsp;became the first Teniente Del Barrio of Dau. The country was under the grip of the Communist insurgency then and MENDOZA was abducted by armed men and disappeared, never to be seen alive again. In <strong>1989</strong>,&nbsp;<strong>BENJAMIN M. MANLAPAZ&nbsp;</strong>was elected as Barangay Captain (Punong Pambarangay) and reinvigorated Barangay Dau with his dynamic and hands-on leadership. It was during his term that Dau reached legendary status in terms of the Katarungang Pambarangay. In <strong>1990</strong>, (<strong>Republic Act 7160</strong>) The Local Government Code of <strong>1990</strong> laid down the foundations of local governments including that of the barangays.</p><p>The concept and system of the Lupon Tagapamayapa was introduced and it was in this arena that Dau gained nationwide fame. &nbsp;In <strong>2002</strong>, a young&nbsp;<strong>LOUIE P. CUNANAN&nbsp;</strong>took over as Barangay Captain. It was during his term that the present (2) storey Barangay Hall Building was constructed. He served a five (5) year term owing to an extension of term enacted by Congress. In <strong>2007</strong>, Punong Barangay was elected in&nbsp;<strong>MARINO &ldquo;ATLAS&rdquo; MORALES JR.,&nbsp;</strong>scion and namesake of the incumbent mayor, who has served the longest continuous tenure of any local government official. He was re-elected in 2010 and has the distinction of being the Barangay Captain of Dau when Mabalacat became a component city in 2012 by virtue of Republic Act 10164. He unfortunately lost in his third bid as Barangay Captain in 2003.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Vision</h3><p>Establish Barangay Dau as a dynamic center of wellness and development of the City of Mabalacat and improve the quality of life of the people.</p><p><strong>Mission</strong></p><p>&nbsp;We shall strive for good governance that is characterized by honesty, efficiency, transparency and integrity in all aspects of public service that we provide to the people.We shall achieve this by: Developing the human resource of the entire community by providing all sectors the opportunities for education, employment, health and welfare and social services. Strengthening the democratic institution and mechanisms of the barangay government by developing a culture of transparency, public service and prudent use of resources. Developing the infrastructure facilities of the community to attract investments and generate employment. Instilling a participatory mode of governance that truly empowers the people in economic and social development.</p>",
                "images": [
                    "assets/barangay-logos/dau.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Lope R. Presco",
                        "year": "1967- 1979"
                    },
                    {
                        "name": "Hon. Francisco Salunga",
                        "year": "1979 – 1989"
                    },
                    {
                        "name": "Hon. Benjamin M. Manlapaz",
                        "year": "1989 – 2002"
                    },
                    {
                        "name": "Hon. Louie P. Cunanan",
                        "year": "2002 – 2007"
                    },
                    {
                        "name": "Hon. Marino G. Morales Jr.",
                        "year": "2007 – 2013"
                    },
                    {
                        "name": "Hon. Dr. Oscar P. Aurelio",
                        "year": "2013 – 2019"
                    },
                    {
                        "name": "Hon. Glenn Derrick A. Llanos Dee ",
                        "year": "2019 up to present"
                    }
                ]
            }
        ]
    },
    {
        "id": "1023",
        "name": "Dolores",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/dolores.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>The Old Dolores was founded in <strong>1776</strong> and abandoned in <strong>July, 1948</strong> when Clark Air Base invaded on its territory boundaries. New Dolores founded <strong>1948</strong> by <strong>Jose Maria Henson</strong> of Angeles. This barrio was named after their patron <strong>saint Nuestra</strong> <strong>Senora de los Dolores</strong> (<strong>Our Lady of Sorrows</strong>).The New Dolores (the present barrio) was once part of <strong>Sitio Mamatitang</strong>. This new barrio was once a sugarcane plantation. In the Old Dolores the first Tiniente or Headman was the founder, Jose Maria Henson followed by the following: Victor Tanglao, Sr. ,Nicolas Henson , Pantaleon Maglalang ,Cifriano Sison , Nicasio Magtanong , Mariano Tanglao , Marcelo Mejia , Venecio Tanglao , Dalmacio Concepcion , Isabelo Munoz , Eulogio Medina , Doroteo Balagtas.</p><p>Every year, the people have a barrio fiesta. Colors by parade both civic and religious, beauty contest, athletic game and be a native zarzuela, the fiesta used to be a pompous one. In every home, everybody was welcomed.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Vision</h3><p>We envision Barangay Dolores to be an ideal community to live on with a God-fearing and respectable, law-abiding citizen.</p><p><strong>Mission</strong></p><p>Truthful and honest governance with a higher determination to work diligently in order to attain our vision.</p>",
                "images": [
                    "assets/barangay-logos/dolores.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "105",
        "name": "Duquit",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/duquit.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Duquit is previously spelled as <strong>DUKIT</strong>. This barrio is an old sitio of &nbsp;Bical. It was named after their patron saint, <strong>San Roque</strong> or <strong>St. Roche of Montpellier</strong>, <strong>France.</strong> According to the elders, DUQUIT is a <strong>species of tall lean trees</strong> which made good as house, posts and sculpture is their form of livelihood. It was then headed by a chieftain today known as Barangay Captain.&nbsp;</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3><strong>Vision</strong></h3><p>Duquit the agro-industrial capital of Mabalacat City, a barangay that is ecologically balance, peaceful, progressive and cooperative, a vibrant, productive, united and God-fearing citizen.</p><h3>Mission</h3><p>A vibrant, progressive, peaceful and united barangay, where its people love and protect its environment. A place where its citizenry are motivated to excel and empowered to be dynamic and competitive. A barangay with fresh, young and dynamic leaders that strive to provide the best socio-economic services to its constituent and finally, a leader, innovator and a model community where its residents proudly says &ldquo;Ganito kami sa Duquit. Sana sa inyo ganito din.&rdquo;</p>",
                "images": [
                    "assets/barangay-logos/duquit.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Eugenio Pare",
                        "year": ""
                    },
                    {
                        "name": "Hon. Juanito Annunciacion",
                        "year": ""
                    },
                    {
                        "name": "Hon. Eulogio Nuguid",
                        "year": ""
                    },
                    {
                        "name": "Hon. AKA Cabyong",
                        "year": ""
                    },
                    {
                        "name": "Hon. Sotero Pare",
                        "year": ""
                    },
                    {
                        "name": "Hon. Daniel Bulaon",
                        "year": ""
                    },
                    {
                        "name": "Hon. Antonio P. Viray",
                        "year": ""
                    },
                    {
                        "name": "Hon. Marjorie Grace M. Sambo",
                        "year": "Present"
                    }
                ]
            }
        ]
    },
    {
        "id": "106",
        "name": "Lakandula",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/lakandula.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Named after <strong>Rajah Lakandula</strong>, the powerful king of Tondo, who made a pact of peace with Legazpi in <strong>1572,</strong> together with <strong>Rajah Matanda</strong> and <strong>Rajah Soliman</strong>. Carved out of the progressive barangay Dau in the Municipality of Mabalacat. Currently consisting of thirteen (13) numbered parallel streets (from 7th to 19th) traversed by various horizontal streetsBeing strategically located beside Clark Freeport&rsquo;s Main Gate, the barangay is a home to numerous <strong>apartments</strong> and <strong>dormitories</strong> of large capacities catering to the ever-growing workforce of the former airbase.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3>Vision</h3><p>We envision a livable and progressive community to enjoy a better life.</p><p><strong>Mission&nbsp;</strong></p><p>We firmly believe that cooperation and unity of the people are the keys to development and growth. We are particularly committed to: Establish an effective governance system to meet the needs of the community; Strengthen community organizations to become more functional; Establish a sustainable environmental resource and community level and; Strengthen family and social values for productivity and spiritual being.</p>",
                "images": [
                    "assets/barangay-logos/lakandula.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "107",
        "name": "Mabiga",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mabiga.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>The origin of its name had two versions. According to the other old folks it was named after &ldquo;biga shrub&rdquo; specie of the grass family growing abundantly during early days of this place. MABIGA means &ldquo;<strong>MANY BIGA</strong>&rdquo;.Another version of some old folks claimed that the topography of Barangay Mabiga is high flat land. And most of the time the sky was cloudy which means in Pampango dialect &ldquo;MA-BIGA&rdquo;, since then the place was called MABIGA.</p><p>The barrio was founded by <strong>Tomas Campos</strong>, and was placed under the patronage of <strong>Santo Tomas</strong>.When the American burned the image in <strong>1898</strong>, <strong>Mrs. Isabel Wyjangco vda</strong>. <strong>De Madlambayan</strong> donated her <strong>La Purisima Concepcion</strong>. <strong>Sta. Maria Magdalena</strong> and most recently, <strong>San Rafael</strong> are also the other patrons. The early settlers were <strong>Santiago anunciacion</strong> and <strong>sons</strong>, <strong>Bartolome </strong>, <strong>Anguelo</strong>, <strong>Juan </strong>and <strong>Agustin</strong>, <strong>Bernardo Tuazon</strong>, <strong>Valentin Bondoc</strong> and <strong>Tomas Campos</strong>.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "<h3><strong>Vision</strong></h3><p><strong>&nbsp;</strong>Barangay Mabiga is a simple community, physically and spiritually with productive citizens who are peace loving and willing to undergo challenges and participate in all barangay projects and programs for sustaining growth and protection to attain self-reliance, independence and prosperity.&nbsp;&nbsp;</p><h3><strong>Mission</strong></h3><p>To safeguard the welfare of the people through implementation of sensible policies and programs that will enable each individual to be involved in Barangay Mabiga a progressive, peaceful, environment-friendly and god-fearing community.</p>",
                "images": [
                    "assets/barangay-logos/mabiga.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Isabelo Gozun",
                        "year": "1967 – 1971"
                    },
                    {
                        "name": "Hon. Tomas Garcia",
                        "year": "1972 – 1986"
                    },
                    {
                        "name": "Hon. Joselito L. Alegre",
                        "year": "1986 – 1997"
                    },
                    {
                        "name": "Hon. Jesus M. Rivera",
                        "year": "1997-2005"
                    },
                    {
                        "name": "Hon. Jesus M. Rivera",
                        "year": "2007-2010"
                    },
                    {
                        "name": "Hon. Emilio S. David, Jr.",
                        "year": "2010-2013"
                    },
                    {
                        "name": "Hon. Elmer R. Calaguas",
                        "year": "2018 - Present"
                    }
                ]
            }
        ]
    },
    {
        "id": "108",
        "name": "Macapagal Village",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/macapagal.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>The origin of its name had two versions. According to the other old folks it was named after &ldquo;biga shrub&rdquo; specie of the grass family growing abundantly during early days of this place. MABIGA means &ldquo;<strong>MANY BIGA</strong>&rdquo;.Another version of some old folks claimed that the topography of Barangay Mabiga is high flat land. And most of the time the sky was cloudy which means in Pampango dialect &ldquo;MA-BIGA&rdquo;, since then the place was called MABIGA.</p><p>The barrio was founded by <strong>Tomas Campos</strong>, and was placed under the patronage of <strong>Santo Tomas</strong>.When the American burned the image in <strong>1898</strong>, <strong>Mrs. Isabel Wyjangco vda</strong>. <strong>De Madlambayan</strong> donated her <strong>La Purisima Concepcion</strong>. <strong>Sta. Maria Magdalena</strong> and most recently, <strong>San Rafael</strong> are also the other patrons. The early settlers were <strong>Santiago anunciacion</strong> and <strong>sons</strong>, <strong>Bartolome </strong>, <strong>Anguelo</strong>, <strong>Juan </strong>and <strong>Agustin</strong>, <strong>Bernardo Tuazon</strong>, <strong>Valentin Bondoc</strong> and <strong>Tomas Campos</strong>.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/macapagal.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Marcos Y. Caligagan",
                        "year": "1997 - 2010"
                    },
                    {
                        "name": "Hon. Nicolas De Guzman, Jr",
                        "year": "2010 -2013"
                    }
                ]
            }
        ]
    },
    {
        "id": "109",
        "name": "Mamatitang",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mamatitang.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Mamatitang is one of the twenty seven (27) barangays of Mabalacat.&nbsp;By the year 1903, when Mabalacat increased its population into 7,409, nineteen (19) barangays were already created and Mamatitang is one of them.</p><p >Barangay Mamatitang acquired its name from the wealthy family settlers named &ldquo;Titang&rdquo; and mama was called to the wealthy Titang. That&rsquo;s the name Mamatitang came from.</p><p>Before the Japanese occupation in the Philippines, Mamatitang has vast agricultural land which contains mostly one thousand five hundred hectares (1, 500 ha.). This includes the land from barangay San Joaquin, Cacutud, Atlu-bola and part from barangay Mangalit. When the American forces helped defended the Philippines, it built military bases which called the Clark Air Force Base which is now the Clark Freeport Zone. The areas that they occupied are the old San Joaquin and Dolores.</p><p >Presently, barangay Mamatitang has approximately fifty-five hectares (55 ha.) including residential and agricultural areas.</p><p >The family who early resides at barangay Mamatitang are the Galang, Medina, Santos, Nalo, the Balilo, Siopongco, and the Garcia&rsquo;s and other settled during the Ventura Santos owned more than half of the land of the barangay and the Siopongco&rsquo;s owned almost one-fourth of the residential land.</p><p >Barangay Mamatitang also has its leaders like the Cabeza de Barangay, Tiniente del Barrio, Barangay Captain and now the Punong Barangay. The known leaders at that time are Teodulo Garcia, Gelacio Balilo, Castor Dizon, Carlos Magtoto, Ruben Isais, Reyes Delos Reyes, and now the incumbent Punong Barangay Honorable Eliser S. Lacsamana. Former Vice Mayor Paquito G. Delos Reyes and Vice-Mayor/Mayor Reynaldo &ldquo;Moc&rdquo; Candelaria are residents of Barangay Mamatitang.</p><p>The Don Teodoro V. Santos Institute, formerly, Mabalacat Institute was founded through the initiative of the son of Dona Africa with the cooperation of the tenant farmers tilling farm lots at Barangay Mamatitang, Barangay Cacutud.</p><p>Other schools are the Barangay Development Center, formerly, Day Care Center and the Mamatitang Primary School. Barangay Mamatitang has approximately three thousand (3,000) in population and one thousang four hundred (1,400) are registered voters.</p><p >People of Barangay Mamatitang are considerably religious. Catholic religion is dominant in the barangay. They built the Chapel of San Roque in honor of the Patron Saint with the same name. They celebrate the feast of San Roque every August 15 and 16 of the year. Other religions are Baptist, Seventh Day Adventist, Protestant and others.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/mamatitang.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "110",
        "name": "Mangalit",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mangalit.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Mangalit is a barangay of the Philippine Municipality of Mabalacat in the province of Pampanga in central Luzon which is part of the Luzon group of islands. The municipality of Mabalacat with a population of about 203,307 and its 27 barangays belong to the urban areas in the Philippines. Mangalit had 617 residents by the end of 2007.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/mangalit.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "111",
        "name": "Marcos Village",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/marcos.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p >Noong unang panahon ay nasa mga bulubundukin ng MARGOT at sapang bato ang mga AETA silay nabubuhay sa pamamagitan ng pagtatanim ng gabi, palay at kamote. At sa pamamagitan ng pangangaso nila ay nakakatikim sila ng mga karne ng usa, ahas at mga baboy damo. </p><p>Malapit sila sa kabihasan pero wala pang isa man sa pamilya nila ang nakakapag-aral sila ay may mga kultura na sila mismo ang gumawa tulad halimbawa ng pakikipag kasundo sa anak nilang babae o lalake sa mga kapwa nila katutubong AETA. </p><p >At meron di silang batas na pansarili na kapag nakapatay ang isang tao ay kailangang buhay dn ang kapalit. Unang alalagak sa hukay ang pi&ntilde;ata at sa ibabaw ay ang pumatay. </p><p>Meron silang kalipunan na ang namamahala ay nangngangalang MAURICIO LAXAMANA, ito ay kanilang sinusunod, payak ang kanilang pamumuhay at ang pinahkukunan nila ng tubing na maiinom ay galling sa batis sa mga sibol wala silang pinupuntahang mga hospital kapag merong nagkakasakit mero silang pinaka albolaryo at sa pamamagitan ng tinatawag na dagaw ay kanilang ginagamot, ang mga may sakit kung minsan sinasayawan nila ang mga may sakit at nakasuot ng bahag at nagaalay ng putting manok bilang pasasalamat. </p><p>Dumating ang ikalawang digmaang pandaigdig at sila ay nagsipag tago sa kabundukan kasama nila sa bundok ang kanilang pinuno nasi MAURICIO LAXAMANA ang kanilang tinatawag na DATU CHIEF. </p><p>Sa pagtatago nila ay may natulungan silang mga sundalong amerikano na si CAPT. CANER at CAPT. BROS. Pinakain nila ito at ginamot, noong maitaboy ng puwersang amerikano at ang mga hapon ay pinasalamatan sila ng gobyernog amerikano, isa sa pinakamatanda ng tribo ang ginawa nilang king alfonso at queen mary ang kanyang kapatid na babae. </p><p>At isa rin ang nagmalasakit sa mga maerikano ang bininyagan nilang prime minister kudiaro laxamana at inilipat sila sa magandang lugar at tinawag nilang macapagal village. </p><p>Gusto ng mga amerikano na walang kasalamuhang hindi kulot ang mga katutubo at dito ay binigyan sila ng karapatan na magpa ospital sa loob ng clark air base tuwing may sakit. </p><p>Binigyan din sila ng ikabubuhay na tinatawag na nilang sanitary land fill nakakapulot sila ng mga tanso, aluminyo at karton na kanilang ibenebenta. </p><p>Sa pagdaan ng panahon ay nakaramdam ng katandaan si datu chief maurico laxamana kaya inilipat niya ang pamumuno kay Isaac lumanlan at sa dahilang dumadami ang mga humahalong mga unat ang buhok kaya inilipiat na naman sila sa tinatawag na san Joaquin sa mabalacat at tinawag nila itong san Joaquin village. </p><p >Dito ay binigyan sila ng family pass ng amerikano na may litrato ng buong pamilya upang makadaan sila palabas at papasok sa mabalacat gate papasok ng village na binabantayan ng mga sundalong amerikano. </p><p >Ngunit sadyang marami ang nagnanais na unat sa mga aeta dahil sa kanilang hanap buhay na galing sa sanitary land fill kaya inilipat na naman sila sa tabi ng bakod ng base na tinatawag nilang negrito village, tulad sa san Joaquin ay ipinagpatayo sila ng paaralan, simbahan at klinika na pwede nilang takbuhan sa simpleng gamutan pero sa oras na kailangan ng maospital ay agad din silang itinatakbo sa base hospital. </p><p >Nagiging Masaya at magaan ang pamumuhay nila dito at dahil marami ng natutunan ang mga katutubo ay natuto silang mamulitika, dito sila nakaisip na bumoto ng mamumuno sa kanila sa pamamagitan ng buto ng patani, naglalagay sila ng litrato ng mga iboboto sa mga garapon at mula sa tinente del baryo hanggang sa mga konsehal ay inaabutan sila ng walong pirasong buto at sila ang nahuhulogan sa garapon na kanilang gusto. </p><p>At ito na nagpapaubaya ang mga amerikano sa estilo ng kanilang pamumuhay na natutuhan nila, at hindi na nabawalan ang iba&rsquo;t-ibang klase ng mga tao na humalo at nanirahan sa village. </p><p >Ipinaresiklo nila ang negrito village bilang marcos village dahil kasalukuyang president ng bansa si pangulong Ferdinand marcos hanggang dumaan ang panahon at napalitan ang mga henerasyon at lalong marami ang namumulitika naghahangad ng magandang pwesto sa pamamagitan ng halalan.</p><p >Mula kay kapitan caner laxamana nahalal nasi anastacio Serrano, sumunod na umupo sa pwesto si vigor laxamana at noong panahon ni pangulong cory Aquino ay umupong isang termino si ginang Rosalina ajos, sumunod na halalan ay si Roberto bernardo sa tatlong termino at ilang taon ding napagtagumpayan ng makaupo si bonifacio estanislao at sa kasalukuyan ay si chairman jose jerry m. dacio sila ay pawing mga unat ang buhok at ilan lang sa mga katutubong aeta ang nagtagumpay na makaupo sa pwesto.</p><p>At ngayon ang tinaguriang marcos village ay isang Masaya at mataong baryo na ang karamihan sa mga nakatira ay nagtatrabaho sa clark air base na iniwan ng mga amerikano.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/marcos.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "112",
        "name": "Mawaque",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/mawaque.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>The name Barangay Mawaque is derived from the work &ldquo;makawaya&rdquo;. It was once a secluded place with houses made of &ldquo;bungalow&rdquo;. &ldquo;sawali,&rdquo; and bamboo.</p><p >The patron saint of Barangay Mawaque is Sta. Teresita. Based from stories of the elders, Sta. Teresita was seen from a far and henceforth became their patron.</p><p  >Agriculture is the primary source of income in the barangay. The residents are farmers of corn(maiz), bitter gourd (ampalaya), (sitaw), and (talong) which they use as capital to sustain their needs and as addition to their savings. They farm in almost one hundred sixty (160) hectares of land and harvest 50-80 tons of rice</p><p>Barangay Mawaque can be seen as 5.3km away in the Mabalacat City map. Because of its distance from the main roads and civilization itself, the barangay was considered as old-fashioned, unorganized, and outdated. The residents back then lived a simple and peaceful life. Time has passed and with the help of new technology, the barangay is now at par with the latest knowledge and innovation.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/mawaque.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Jose Noel A. Dimarucut",
                        "year": "2010 - Present"
                    }
                ]
            }
        ]
    },
    {
        "id": "113",
        "name": "Paralayunan",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/paralayunan.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Ayon sa salaysay ng mga matatanda dito sa aming barangay, dati raw ang PARALAYUNAN ay tinatawag na GUYUNG-GUYUNG. Sabi nila na ang Mahal na Patron ng SAN ANTONIO DE PADUA at SAN ISIDRO DE LABRADOR ay nakipaglayunan daw sa Guyung-Guyung (layunan-ibig sabihin nakatira). Magmula raw noong makitira ang dalawang Santo sa guyung-gyung pinalitan na ng mga tao ang pangalan ng lugar sa BARANGAY PARALAYUNAN.</p><p>Ito ang kwentong nakagisnan ng mga tao ditto kung saan at paano nagging PARALAYUNAN ang aming baranagay.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/paralayunan.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "114",
        "name": "Poblacion",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/poblacion.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Poblacion is located at the center of the City of Mabalacat, it is as well the capital of the City, Barangay Poblacion was established on the year 1712, it is also one of the first five established barangay in mabalacat. The known Our Lady of Grace Parish Church can be found &nbsp;here which is one of the biggest churches in Pampanga, also the first Elementary School in Mabalacat which has been the occupying force of the Spaniards way back on World War II was situated here.</p><p>Barangay Poblacion was also one of the affected areas during the volcanic eruption of Mt. Pinatubo, but because of the diligence and perseverance of the living here, Barangay Poblacion had adjusted and regains its livelihood. The lives of the people living in Poblacion went industrialization for the base of the American Soldiers; this event serves an opportunity to the people living in poblacion to settle in a job.</p><p>In present time, Poblacion is one of the barangay&rsquo;s which has good record not hust in physical aspect but likewise in all in tenure.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/poblacion.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "116",
        "name": "San Francisco",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/sanfrancisco.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>About the middle of the eighteenth (18<sup>th</sup>) century the town of Mabalacat under the administration of a negrito chief named Captain Caragan. This chieftain, according to information appointed another negrito, who&rsquo;s nobody, would remember as barrio lieutenant of this place during the administration of Captain Caragan, the parish priest assigned in the loving friar who donat &nbsp;VISION.</p><p >It was from this time of the barrio patron saint that the barrio got its name. San Francisco had ever since two (2) Sitio&rsquo;s located in the easthern of the barrio.</p><p >Talimundoc got its name from the high elevation of the place. Talimundoc means a lovely bamboo grove. As there was only one bamboo grove growing in the place, the Sitio was called Cuayan a Bugtong.</p><p >The friar priest, a Spaniard, was responsible for the construction of the first catholic cemetery located just a stone throw from the market place. This catholic cemetery was closed for a very long time and replace by municipal cemetery located in the southwest of the market building along the railroad station. The barrio San Francisco has been indeed very lucky for the construction. It is said that these two (2) edifices were constructed in the year 1902. The construction of the national highway which passed through the barrio and runs from south and north and contributed to the increase of its population. Many people from other barangay migrated to this barangay and constructed permanent homes. The public market located also in the barangay was one of the factors that increase the population. Most of the sellers and storekeepers in the market are from this barangay. The barangay is traversed by a brook name Quitangil. This brook runs from west to east. In the past the people used to catch fish using a line called Quitang. Quitang composed of many hooks. Many people used this method of catching fish and there were many quitang along brook was called Quitangil.</p><p>In the later part of the Spanish occupation in sugar mill was established beside the Quitangil brook. It was that this sugar mill was run by water power whose source of energy was a brook. The sugar mill continued to function until 1916.</p><p>During the Spanish tie there was a sort of school called &ldquo;Bantayan&rdquo;. The Bantayan was a certain place on the ground which roofs but no walls and taught by a certain lame man named Apung Beltong Pile. This teacher taught children reading, writing, praying, arithmetic, and catechism. The children were well discipline and very much fear of the man, Apung Beltong Pile, he was very strict. He used to punish his pupils offenders by having kneel them on mongo beans for few minutes, by beating them with a peril, by having them to make stunts like catching dragonflies or telling to stretch their hands sideward straight for a long time.</p><p>Barangay San Francisco is situated exactly ninety three kilometers (93) north of Manila. It is one of the developed barangay of the Municipality of Mabalacat. It serves as the transit for economics, trades and industrial transactions because it covers in its territory the public market and access road to Clark Special Economic Zone.</p><p>Many residents of the barangay are divided into eight (8) puroks. It has six (6) schools, three (3) owned by group of individuals and the other three (3) by Barangay Day Care Center which is subsidized by the government, Saint Anthony Technological College, Children of Fatima, School of the Infant Jesus and Nehemiah.</p><p>Barangay San Francisco is situated on the northern part of the Municipality of Mabalacat. It is bounded on the north of Barangay Poblacion; on the south of Barangay Sto.Rosario; on the west by Clarkfield; and on the east by Barangay Sta.Maria.</p><p>It has a total land area of 129,783 square meters. San Francisco is approximately 1km away from Poblacion. Its topography is generally flat and its type of soil is sandy loam. It has two (2) creeks on the boundary of Mabiga and San Francisco.</p><p>The climate/weather is similar to the other Barangays of Mabalacat City and other towns. It has two (2) the wet and dry seasons. The months of May to November are considered the wet seasons while the months of December to April are the dry season.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/sanfrancisco.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "117",
        "name": "San Joaquin",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/sanjoaquin.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay San Joaquin is approximately 26.7 km. away from Provincial Capitol, 1.5 km. away from Municipal Hall and 500 meters away from National Highway. It is bounded on the North by Barangay Dolores, on the South by Barangay Poblacion, on the East by Barangay Mamatitang and on the West by Clark Special Economic Zone, all of Mabalacat.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/sanjoaquin.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "118",
        "name": "Santa Ines",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/staines.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Since Mabalacat was found, Barangay Sta. Ines was considered one of the first barrios of Mabalacat. It was considered in the year 1890. The first living people in the barrios and to other barrios were Aetas. 80% of the land of Sta. Ines was rice field and only about 120 households are living in this barrio. One of the very first families who settled in the barrio was Dela Cruz Family. A very well-known and wealthy clan, who owns 60% of the total land area of the barangay. Because of their power, the Dela Cruz family resettled all the Aetas to nearby areas like Porac, Pampanga. The family has a Patron Saint St. Agnes (Sta. Ines).</p><p>Liberation came many resident of Sta.Ines found employment at Clark, Airbase. A few years later, in early 1950&rsquo;s their primary school was established. The pioneer teachers were Mrs. Concha Dizon, Ms. Datu and Ms. Angeles Magat. It was during this period that the Sta.Ines residents enjoined some form of hope and economic resurgence.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/staines.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "119",
        "name": "Santa Maria",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/stamaria.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Sta.Maria was named under its Patron Saint Maria Magdalena under the care of the prominent person Alejandrino Angeles. Originally, the Barangay proper has only 2 households, Sitio Libutad has 19 and Sitio cuatro has 4.</p><p>Before the war in 1930, there was no designated Barangay Captain. The town official only communicated directly to the landlords.</p><p>After the 2<sup>nd</sup>&nbsp;world war in 1941, there was appointed official called &ldquo;TINYENTE DEL BARYO&rdquo; and he was appointed by the Town Mayor. Tinyente del Baryo is the head of the Barangay that time and no other official aside from himself.</p><p>When the Barangay Code was administrated, the Barangay Officials are now elected which is the Barangay Captain and 5 members of the council and he will get or appoint Secretary and Treasurer.</p><p>1<sup>st</sup>&nbsp;Tinyente Del Baryo was Mr.Ananyas Galang. Next to him who was appointed was Mr.Licup.</p><p>In addition, Mr.Elpidio Sarmiento was appointed by the people in Sta.Maria in year 1986 &ndash; 1989 during the time a problem in the local government.</p><p>There was no Barangay Hall at that time. Meetings were held to different household. Later on, meeting was moved to the chapel, Sta.Maria Magdalena Chapel. During the time of Hon. Bienvenido Manalo, he was able to start and built a small barangay hall at Sitio Libutad. From then, meeting was moved from chapel to the Barangay Hall. After the small barangay hall, a newly and developed barangay hall was built under the time of Hon.Cesar G. Manalo and roads were also concreted. Until present, the said newly developed Barangay Hall still exist in which election been held.</p><p>Means of livelihood that time was 98% agriculture and 2% laborer. But in today&rsquo;s generation, it is 40% agriculture and 60% laborer.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/stamaria.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "120",
        "name": "Santo Rosario",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/storosario.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>It was early year of 1960 under the administration of&nbsp;<strong>PRESIDENT DIOSDADO MACAPAGAL</strong>. During that time there was a program of the government regarding certain requirement to a place tp be considered as a community. One factor that has to be considered were the population of the said place, the majority of the inhabitants to become independent and the capability of a certain group of people to be able to extend responsible governance on the establishment of a community. All obligation on the organization of a Barangay were convene, that started the composition of&nbsp;<strong>BARANGAY SANTO ROSARIO</strong>&nbsp;which was sited as one of the Sitio of Barangay San Francisco by that time. It was the aspiration of the people of Barangay Santo Rosario that relent an opportunity to build their own society to measure the competency on their gallantry.</p><p><strong>The naming of Barangay Santo Rosario</strong></p><p>There was a certain religious person named&nbsp;<strong>MR. PEDRO DIZON</strong>&nbsp;who donated a Patron Saint name SANTO ROSARIO by the people of Mawaque were terrified by the war, the rationalization why they migrated in Barangay Santo Rosario. When Mr. Pedro Dizon passed away all his belongings were left to her daughter who lived in Barangay Santo Rosario name Mrs. Juanita Dizon who decided later on about the naming of the said barangay under the name of the&nbsp;<strong>PATRON SAINT SANTO ROSARIO.</strong></p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/storosario.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "121",
        "name": "Sapang Balen",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/sapangbalen.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Barangay Sapang Balen is approximately 37 km. away from Provincial Capitol, 7 km. away form City Hall and 7 km. away from National Highway. It is bounded on the North by Barangay Atlu-Bola and South of Barangay Poblacion on the East of Barangay Mangalit and on the West of Barangay Bundagul, all of Mabalacat.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/sapangbalen.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    },
    {
        "id": "122",
        "name": "Sapang Biabas",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/sapangbiabas.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Before the Japanese Forces occupied the Philippines in 1941, there were almost 200 houses/families according to old folks who still reside in this barangay. Sapang Biabas is composed of three Sitios namely: Sitio Mauli, Barangay Proper, and Sitio Makabakle.</p><p>Tolentino, David, Espino and Feliciano families occupied Sitio Mauli. At the barangay proper, you will locate the Nacpel and Madlambayan families. At Sitio Makabakle, the families of Ga&ntilde;a, Tiglao and Diglao are located in.</p><p>&nbsp;Their means of livelihood and industry comes mostly from tilling the land. Farming is the main employment and activity of the inhabitants. A Barrio Lieutenant leads the barangay and is an elected official. The first Barrio Lieutenant elected was Eulogio Santos, who was succeeded by Feliciano Magsino, Simplicio David, Felipe Salta, Leonardo Cunanan, and Eusebio Liwanag. Eusebio Liwanag was gun down and assassinated at Sitio Maria Consolacion of Barangay Dau, after attending a wedding party of his relative.</p><p>Then Mabalacat Mayor Hon. Wilfredo Halili appointed Leonardo M. Miranda as Officer-in-charge during the Martial Law regime (Sept. 1972-1986) under the leadership of then President Ferdinand E. Marcos, the then elected first kagawad declined the position and so Leonardo M. Miranda became the successor of Eusebio Liwanag. After the Martial Law (Feb. &rsquo;86 &ndash; EDSA Revolution), Tomas G. Espino Sr. replaced Leonardo Miranda during the revolutionary government of then President Corazon Aquino.</p><p>According to the people in the early days, there was a small river along the side of the main road and its water is free flowing. On the both sides of the river, you will catch a sight of many wonderful and growing guavas bearing enormous fruits and on this side were the small children mainly boys pasture their carabaos. The river was very clean and the water is crystal-like and can be used as mirror. The water coming from the river can be consumed as drinking substance as well for washing clothes. During summer when the weather is hot and the water is cold enough, people of the said barangay, go out to refresh and bath at the river and at the same time have fun with their family. Before the explosion of Mt. Pinatubo, there were only 200 registered voters and approximately 600 residents living in the barangay.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/sapangbiabas.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": [],
                "politicians": [
                    {
                        "name": "Hon. Esteban C. Liwanag",
                        "year": "1994 – 1997"
                    },
                    {
                        "name": "Hon. Esteban C. Liwanag",
                        "year": "2002 - 2005"
                    },
                    {
                        "name": "Hon. Rizaldo S. Garcia",
                        "year": "2007 - 2016"
                    },
                    {
                        "name": "Hon. Soraida O. Cabuang",
                        "year": "2018 – up to present"
                    }
                ]
            }
        ]
    },
    {
        "id": "123",
        "name": "Tabun",
        "width": 5616,
        "height": 3744,
        "logo_url": "assets/barangay-logos/tabun.png",
        "facebookLink": "",
        "websiteLink": "",
        "details": [
            {
                "type": "History",
                "content": "<p>Long time ago, Barangay Tabun, was divided into four (4) sitios: Sitio Apitan, Sitio Iba, Sitio Irong (a.k.a Donya Africa), and Barangay Tabun.</p><p>A hill where a vacation house owned by Honorio Santos and his wife, Do&ntilde;a Africa, was situated in the midst of the sitios. The Santos family was once the owner of almost three hundred and twenty (320) hectares of land surrounded by rice paddies and sugarcanes.</p><p>Barangay Tabun symbolizes the vast storage of water supply of all the farmers living in the area for most of the residents work in the agriculture field.</p><p>In the year 1946 when the heat between the government and the &ldquo;Guirila&rdquo; group was at its peak, the residents&nbsp; Sitio Iba were forced to evacuate and relocate to their neighboring sitio, Barangay Tabun.</p><p>In 1960&rsquo;s Enrique Garbo Become the first Tinyente Del Baryo or &ldquo;Barangay Captain&rdquo; from Sitio Irong. He was succeeded by Ben Pangan who headed the very first &ldquo;Fiesta ng Baryo&rdquo; in a three-day celebration. During Pangan&rsquo;s leadership, He headed the establishments of a church named after Apu Lourdes from Sitio Iba and held a feast on February 14. at present day time, Barangay Tabun&rsquo;s&nbsp; fiesta is celebrated on May 15 known as Feast of San Isidro Labrador.</p><p>Ben Pangan was succeeded by Kapitan Abelino Garcia in November 11, 1968 through barangay election. However, Kapitan Garcia retreated from office because of the proclamation of &ldquo;Martial Law.&rdquo; Being the first Kagawad, Servillino Datu took his place as the new Kapitan.</p><p>When Mount Pinatubo of Zambales erupted in the year 1990, Barangay Tabun turned into a land covered with volcanic ash and lava and the residents were forced to evaluate to different resettlement areas namely:&nbsp; Mauaque Resettlement, Phase 1 and Phase 2 Camachiles, Mabalacat, Pampanga. Many years have passed after the tragedy and through the efforts of Kapitan Gerlado De Leon, Barangay Tabun rose again.</p><p>In 2002, Ador Pascual was elected as kapitan and served for eight (8) years. He was then succeeded by Ranie O. De Leon in 2011 and served until 2013.</p><p>At present, the efforts of Kapitan Jerry Magsino towards his constituents as the current Barangay Captain is being appreciated.</p>",
                "images": []
            },
            {
                "type": "Fiesta",
                "content": "Sample Content",
                "images": []
            },
            {
                "type": "Branding",
                "content": "Sample Content",
                "images": [
                    "assets/barangay-logos/tabun.png"
                ]
            },
            {
                "type": "Politicians",
                "content": "Sample Content",
                "images": []
            }
        ]
    }
]